## ----load-libraries----------------------------------------------------
# load raster package
library(sp)
library(raster)

#烦死了感觉写不完论文了救命啊啊啊啊啊啊好烦好烦好烦啊啊啊啊啊啊啊啊啊啊啊啊啊烦死了！！
#system.time函数用于计算代码运行的时间。

system.time({

 
# 载入栅格
r1 <- raster("G:/Bachelor_Degree_Thesis/DATA/LUCC_30m_WHU/Extracted/CLCD_v01_1985_clip.tif", band = 1)
r2 <- raster("G:/Bachelor_Degree_Thesis/DATA/LUCC_30m_WHU/Extracted/CLCD_v01_2019_clip.tif", band = 1)

# check that spatial extent is the same
extent(r1) == extent(r2)

#plot(r1) #稍微展示一下，没必要运行
#plot(r2)

# create r3 from r1，从r1创建新的栅格
r3 <- raster(r1)

# fill based on conditions，计算方法肯定还有迭代的空间，如果一遍一遍进行计算，算法的效率未免也太低了。
# 好像没有办法避免，怎么办，只能硬算

r3[r1 == 1 & r2 == 1] <- 1
r3[r1 == 1 & r2 == 2] <- 1
r3[r1 == 1 & r2 == 3] <- 1
r3[r1 == 1 & r2 == 4] <- 1
r3[r1 == 1 & r2 == 5] <- 1
r3[r1 == 1 & r2 == 6] <- 1
r3[r1 == 1 & r2 == 7] <- 1
r3[r1 == 1 & r2 == 8] <- 0
r3[r1 == 1 & r2 == 9] <- 1

r3[r1 == 2 & r2 == 1] <- 0
r3[r1 == 2 & r2 == 2] <- 1
r3[r1 == 2 & r2 == 3] <- 0
r3[r1 == 2 & r2 == 4] <- 0
r3[r1 == 2 & r2 == 5] <- 0
r3[r1 == 2 & r2 == 6] <- 0
r3[r1 == 2 & r2 == 7] <- 0
r3[r1 == 2 & r2 == 8] <- 0
r3[r1 == 2 & r2 == 9] <- 1

r3[r1 == 3 & r2 == 1] <- 0
r3[r1 == 3 & r2 == 2] <- 1
r3[r1 == 3 & r2 == 3] <- 1
r3[r1 == 3 & r2 == 4] <- 0
r3[r1 == 3 & r2 == 5] <- 0
r3[r1 == 3 & r2 == 6] <- 0
r3[r1 == 3 & r2 == 7] <- 0
r3[r1 == 3 & r2 == 8] <- 0
r3[r1 == 3 & r2 == 9] <- 1

r3[r1 == 4 & r2 == 1] <- 0
r3[r1 == 4 & r2 == 2] <- 1
r3[r1 == 4 & r2 == 3] <- 1
r3[r1 == 4 & r2 == 4] <- 1
r3[r1 == 4 & r2 == 5] <- 0
r3[r1 == 4 & r2 == 6] <- 0
r3[r1 == 4 & r2 == 7] <- 0
r3[r1 == 4 & r2 == 8] <- 0
r3[r1 == 4 & r2 == 9] <- 1

r3[r1 == 5 & r2 == 1] <- 0
r3[r1 == 5 & r2 == 2] <- 1
r3[r1 == 5 & r2 == 3] <- 1
r3[r1 == 5 & r2 == 4] <- 1
r3[r1 == 5 & r2 == 5] <- 1
r3[r1 == 5 & r2 == 6] <- 1
r3[r1 == 5 & r2 == 7] <- 0
r3[r1 == 5 & r2 == 8] <- 0
r3[r1 == 5 & r2 == 9] <- 1

r3[r1 == 6 & r2 == 1] <- 0
r3[r1 == 6 & r2 == 2] <- 1
r3[r1 == 6 & r2 == 3] <- 1
r3[r1 == 6 & r2 == 4] <- 1
r3[r1 == 6 & r2 == 5] <- 0
r3[r1 == 6 & r2 == 6] <- 1
r3[r1 == 6 & r2 == 7] <- 0
r3[r1 == 6 & r2 == 8] <- 0
r3[r1 == 6 & r2 == 9] <- 1

r3[r1 == 7 & r2 == 1] <- 0
r3[r1 == 7 & r2 == 2] <- 1
r3[r1 == 7 & r2 == 3] <- 1
r3[r1 == 7 & r2 == 4] <- 1
r3[r1 == 7 & r2 == 5] <- 1
r3[r1 == 7 & r2 == 6] <- 1
r3[r1 == 7 & r2 == 7] <- 1
r3[r1 == 7 & r2 == 8] <- 0
r3[r1 == 7 & r2 == 9] <- 1

r3[r1 == 8 & r2 == 1] <- 1
r3[r1 == 8 & r2 == 2] <- 1
r3[r1 == 8 & r2 == 3] <- 1
r3[r1 == 8 & r2 == 4] <- 1
r3[r1 == 8 & r2 == 5] <- 1
r3[r1 == 8 & r2 == 6] <- 1
r3[r1 == 8 & r2 == 7] <- 1
r3[r1 == 8 & r2 == 8] <- 1
r3[r1 == 8 & r2 == 9] <- 1

r3[r1 == 9 & r2 == 1] <- 0
r3[r1 == 9 & r2 == 2] <- 0
r3[r1 == 9 & r2 == 3] <- 0
r3[r1 == 9 & r2 == 4] <- 0
r3[r1 == 9 & r2 == 5] <- 0
r3[r1 == 9 & r2 == 6] <- 0
r3[r1 == 9 & r2 == 7] <- 0
r3[r1 == 9 & r2 == 8] <- 0
r3[r1 == 9 & r2 == 9] <- 1





plot(r3) #绘制

writeRaster(r3,"G:/Bachelor_Degree_Thesis/DATA/LC_Change/1985-2019.tif") #导出

})

#barplot(r3) #粗略统计，生成柱状图
#本代码是基础代码，根据两个栅格值的情况，对新栅格进行赋值，使用了非常笨的办法：设定单个规则，每个规则都要求R对两个基础栅格的全部栅格值进行运算，代码效率非常的低
#R语言怎么这么慢啊？？
